/* Archive - NSOpenPanel button title */
"Archive" = "Arkistoi";

/* Archive Files - NSOpenPanel title */
"Archive Files" = "Arkistoi tiedostot";

/* title of progress window */
"Archive Utility" = "Arkistotyökalu";

/* alert: archiving operation was canceled */
"Archiving \"%1$@\" into \"%2$@\" was canceled." = "Kohteen \"%1$@\" pakkaaminen arkistoon \"%2$@\" kumottiin.";

/* progress string when archiving */
"Archiving \"%1$@\"\\U2026" = "Arkistoidaan ”%1$@”…";

/* Cancel */
"Cancel" = "Kumoa";

/* Progress subtext when cleaning up */
"Cleaning up\\U2026" = "Siivotaan…";

/* alert: unable to unpack archive - unable to find suitable target directory */
"Could not find a writable folder for the contents of \"%1$@.\"  Try moving it to a writable folder." = "Kirjoitettavaa kansiota kohteen ”%1$@” sisällölle ei löytynyt. Siirrä kohde kansioon, johon voidaan kirjoittaa.";

/* alert: unable to unarchive - target is not a dir or does not exist */
"Could not find a writable folder in which to create an archive of \"%1$@.\"  Try moving it to a writable folder." = "Kirjoitettavaa kansiota, jossa luoda arkisto kohteesta ”%1$@”, ei löytynyt. Siirrä kohde kansioon, johon voidaan kirjoittaa.";

/* debug alert: finished archiving */
"Finished archiving \"%1$@\" into \"%2$@\"." = "\"%1$@\" on pakattu arkistoon \"%2$@\".";

/* debug alert: archive finished unpacking */
"Finished unarchiving \"%1$@\" into \"%2$@\"." = "Arkisto \"%1$@\" on purettu kohteeksi \"%2$@\".";

/* Default name of progress window */
"Progress" = "Edistyminen";

/* prompt when trying to save archive/unarchive */
"Select a location to save \"%1$@\"\\U2026" = "Valitse sijainti, jonne ”%1$@” tallennetaan…";

/* alert: unable to make archive */
"Unable to archive \"%1$@\" into \"%2$@\".\n(Error %3$d - %4$@.)" = "Kohdetta ”%1$@” ei voitu arkistoida sijaintiin ”%2$@”.\n(Virhe %3$d - %4$@.)";

/* unable to delete source */
"Unable to delete \"%1$@\"." = "Kohdetta \"%1$@\" ei voitu poistaa.";

/* unable to delete archive */
"Unable to delete archive \"%1$@\"." = "Arkistoa \"%1$@\" ei voitu poistaa.";

/* alert: unarchiving this flavor archive is not supported */
"Unable to expand \"%@\" - it is in an unsupported format." = "Arkistoa ”%@” ei voida laajentaa, koska sen muotoa ei tueta.";

/* alert: unarchiving stuffit archives is not supported */
"Unable to expand \"%@\" - Stuffit archives are not supported." = "Arkistoa ”%@” ei voida purkaa. Stuffit-arkistoja ei tueta.";

/* unable to finish unarchiving alert - move failed */
"Unable to finish unarchiving \"%1$@\" into \"%2$@\".\nCould not move \"%3$@\" into destination directory." = "Arkiston \"%1$@\" purkamista kohteeseen \"%2$@\" ei voitu suorittaa loppuun.\n Kohdetta \"%3$@\" ei voitu siirtää kohdehakemistoon.";

/* unable to move source */
"Unable to move \"%1$@\" to \"%2$@." = "Kohdetta \"%1$@\" ei voitu siirtää kohteeseen \"%2$@\".";

/* unable to move source alert - destination does not exist or not a directory */
"Unable to move \"%1$@\" to \"%2$@\".\nTarget does not exist or is not a directory." = "Arkistoa \"%1$@\" ei voitu siirtää kohteeseen \"%2$@\".\nKohde ei ole olemassa tai se ei ole hakemisto.";

/* unable to trash source */
"Unable to move \"%1$@\" to Trash." = "Kohdetta \"%1$@\" ei voitu siirtää roskakoriin.";

/* unable to move archive */
"Unable to move archive \"%1$@\" to \"%2$@." = "Arkistoa \"%1$@\" ei voitu siirtää kohteeseen \"%2$@\".";

/* unable to move alert - destination does not exist or not a directory */
"Unable to move archive \"%1$@\" to \"%2$@\".\nTarget does not exist or is not a directory." = "Arkistoa \"%1$@\" ei voitu siirtää kohteeseen \"%2$@\".\nKohde ei ole olemassa tai se ei ole hakemisto.";

/* unable to trash archive */
"Unable to move archive \"%1$@\" to Trash." = "Arkistoa \"%1$@\" ei voitu siirtää roskakoriin.";

/* unable to open archive for unarchive alert */
"Unable to open archive \"%1$@\".\n(Error %2$d - %3$@.)" = "Arkistoa ”%1$@” ei voida avata.\n(Virhe %2$d - %3$@.)";

/* unable to open damaged archive for unarchive alert */
"Unable to open damaged archive \"%1$@\"." = "Vioittunutta arkistoa ”%1$@” ei voida avata.";

/* unable to unarchive alert */
"Unable to unarchive \"%1$@\" into \"%2$@\".\n(Error %3$d - %4$@.)" = "Arkistoa ”%1$@” ei voitu purkaa sijaintiin ”%2$@”.\n(Virhe %3$d - %4$@.)";

/* Unarchive - NSOpenPanel button title */
"Unarchive" = "Pura arkisto";

/* Unarchive File - NSOpenPanel title */
"Unarchive File" = "Pura tiedosto";

/* alert: unarchiving operation was canceled */
"Unarchiving \"%1$@\" into \"%2$@\" was canceled." = "Arkiston \"%1$@\" purkaminen kohteeseen \"%2$@\" kumottiin.";

/* progress string when unarchiving */
"Unarchiving \"%1$@\"\\U2026" = "Puretaan arkistoa ”%1$@”…";

